---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode
source: html/91f1d3f0-0e5c-1102-89b7-28aa81fbfa18.htm
---
# ElectricalAnalyticalNode Properties

The id of the assembly instance to which the element belongs.